Revit 2024 API
SpecTypeId.StructuralFrequency Property
 Frequency, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId StructuralFrequency { get; }
Visual Basic
Public Shared ReadOnly Property StructuralFrequency As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralFrequency {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace